snlkuharlocal/src/Documents/ЗаданиеНаМаркировку/ЗаданиеНаМаркировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаМаркировку</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <registerRecords>InformationRegister.РезервыКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ОшибкиПолученияКМ</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемаркировка</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>СформированыАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>фУпрощенныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьБлочки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьКоробки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>фАгрегироватьПалеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлочков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВБлочке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтукНаПалете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Штука</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Блочок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗабронированоКМ_Коробка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодПалеты</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛистМаркировки</name>
      <type>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
      </type>
    </attributes>
    <attributes>
      <name>Распечатан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Нанесен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерБлочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаБронированияКМ</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистМаркировки</types>
        <types>DocumentRef.ЛистМаркировкиОстатков</types>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.ЛистНабора</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СтатусыКодовМаркировкиФакт/СтатусыКодовМаркировкиФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКодовМаркировкиФакт</name>
  <enumValues>
    <name>Эмитирован</name>
  </enumValues>
  <enumValues>
    <name>ПереданПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ГотовКПечати</name>
  </enumValues>
  <enumValues>
    <name>Распечатан</name>
  </enumValues>
  <enumValues>
    <name>Нанесен</name>
  </enumValues>
  <enumValues>
    <name>НанесенВиртуально</name>
  </enumValues>
  <enumValues>
    <name>Вложен</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>ВОбороте</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ЗакупленВРФ</name>
  </enumValues>
  <enumValues>
    <name>Выбыл</name>
  </enumValues>
  <enumValues>
    <name>Зарезервирован</name>
  </enumValues>
  <enumValues>
    <name>Расформирован</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяАгрегация</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыКарточкиНоменклатурыВЧЗ/СтатусыКарточкиНоменклатурыВЧЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКарточкиНоменклатурыВЧЗ</name>
  <enumValues>
    <name>НеПодлежитМаркировке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкевНК</name>
  </enumValues>
  <enumValues>
    <name>НеСоздана</name>
  </enumValues>
  <enumValues>
    <name>Создана</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПодписания</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/Единицы/Единицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Единицы</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ОКЕИ</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЗаданиеНаМаркировку/ObjectModule.bsl
#Область СобытияОбъекта

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь);
	
	ДокОснование	= ДанныеЗаполнения;
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда Возврат КонецЕсли;	
	
	ТипОснования = ТипЗнч(ДокОснование); 
	
	Если ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		//Валетов + 26,11,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7985 
		ДокСМаркировкой = ПолучитьРеквизитШапки(ДокОснование,"ТребуетсяМаркировка","Документ");
		Если НЕ ДокСМаркировкой Тогда 
			СообщитьИзМодуля("РНК не требует маркирвоки, ЗНМ по ней сформирован не будет!");
			Возврат;
		КонецЕсли;
		//Валетов -			
		ЗаполнитьПоРНК();	
		//Валетов + 06,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-6363
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.Перемещение") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаМаркировкуТовары.Ссылка КАК Ссылка,
		|	СУММА(ЗаданиеНаМаркировкуТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаданиеНаМаркировку.Товары КАК ЗаданиеНаМаркировкуТовары
		|ГДЕ
		|	ЗаданиеНаМаркировкуТовары.Ссылка.Проведен
		|	И ЗаданиеНаМаркировкуТовары.Ссылка.ДокОснование = &ДокОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданиеНаМаркировкуТовары.Ссылка";
		Запрос.УстановитьПараметр("ДокОснование",ДокОснование);
		Результат = запрос.Выполнить().Выгрузить();
		Если ДокОснование.КоличествоДокумента <= Результат.Итог("Количество") Тогда
			СообщитьИзМодуля("ЗНМ не создан! По данному ПРМ уже есть ЗНМ на общее количество: " +  Результат.Итог("Количество"));
			Возврат;
		КонецЕсли;
		//Валетов - 
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)          
	Если СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена 
		И ВсеКодыВСтатусеНанесен(Ссылка)	//Иногда перепроводят документы в промежуточных стадиях - тогда нужно переформировывать движения
		Тогда 
		Возврат;
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	СформироватьДвижения();	
КонецПроцедуры

Функция ПолучитьУникальныеЗначенияКолонки(ИмяКолонки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	" + ИмяКолонки + "
	|ИЗ
	|	Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &Ссылка	
	|	И " + ИмяКолонки + " <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	" + ИмяКолонки + ".Наименование
	|";	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(ИмяКолонки);
КонецФункции //ПолучитьУникальныеЗначенияКолонки(ИмяКолонки)

Процедура ЗаписатьСтатусКодов(МассивКодов, НЗ, Статус)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка	КАК ШтрихКодУпаковки,
	|	ТипШК	КАК ТипШК
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	Ссылка В (&МассивКодов)
	|";
	
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		Движение = НЗ.Добавить();		
		
		Движение.Период				= Дата;
		
		Движение.ШтрихКодУпаковки	= Выборка.ШтрихКодУпаковки;		
		Движение.ТипШК				= Выборка.ТипШК;
		
		Движение.Местонахождение	= Подразделение;
		Движение.Статус				= Статус;
	КонецЦикла;
КонецПроцедуры //ЗаписатьСтатусКодов(МассивКодов, Статус)
 
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор 					= ПараметрыСеанса.Пользователь;
	Комментарий 			= "";
	СостояниеНакладной 		= Перечисления.СостоянияНакладной.ВРаботе;
	СформированыАгрегации   = Ложь;
	
	Товары.Очистить();
	ШтрихкодыУпаковок.Очистить();
	ШтрихкодыКоробок.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	ОбновитьСтатусыНанесения();
	
	Если Модифицированность() Тогда
		Если фУпрощенныйРежим Тогда
		Иначе
			КоличествоДокумента = ШтрихкодыУпаковок.Количество();	
			Если КоличествоДокумента > 0 тогда
				ЗаполнитьТоварыПоКМ(ЭтотОбъект);
			КонецЕсли;		
		КонецЕсли;
		
		// Кухарь А.Ю.  19.04.2025 начало
		// ОбновитьСоставКоробок();
		если  фАгрегироватьКоробки или фАгрегироватьБлочки или фАгрегироватьПалеты Тогда 
			ОбновитьСоставКоробок();
		КонецЕсли;	 
		// Кухарь А.Ю.  19.04.2025 конец     
		
		// Кухарь А.Ю. 24.10.2025 начало
		// HELP-7623
		если ДатаНачалаСканирования = ПустаяДата() и ШтрихкодыУпаковок.Количество()> 0 тогда  
			ДатаНачалаСканирования = ТекущаяДата();
		КонецЕсли;
		// Кухарь А.Ю. 24.10.2025 конец
		
	КонецЕсли;	

	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//Документы.ЗаданиеНаМаркировку.ЗарегистрироватьИспользованныеКоробки(Ссылка);
КонецПроцедуры

#КонецОбласти 

Функция ВсеКодыВСтатусеНанесен(Регистратор)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипШК,
	|	Статус
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт КАК СтатусыКМ_Факт
	|ГДЕ	
	|	Регистратор = &Регистратор	
	|	И Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКодовМаркировкиФакт.Нанесен)
	|";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат НЕ (Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ТипШК));	
КонецФункции //ВсеКодыСтатусеНанесен(Регистратор) 

Функция СформироватьДвижения(ЗаписыватьДвижения = Ложь) Экспорт	
	СтатусКМ_Факт		= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;	
	Если фУпрощенныйРежим И СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена Тогда
		СтатусКМ_Факт	= Перечисления.СтатусыКодовМаркировкиФакт.Нанесен;			
	КонецЕсли; 
			
	Для Каждого СтрокаТЧ из ПолучитьТаблицуШК(Ссылка) Цикл		
		Движение = Движения.СтатусыКМ_Факт.Добавить();		
		
		Движение.Период				= ?(ЗначениеЗаполнено(СтрокаТЧ.ДатаБронированияКМ), СтрокаТЧ.ДатаБронированияКМ, Дата);
		
		Движение.Номенклатура		= СтрокаТЧ.Номенклатура;
		Движение.ТипШК				= СтрокаТЧ.ТипШК;
		Движение.ШтрихКодУпаковки	= СтрокаТЧ.ШтрихкодУпаковки;
		Движение.Местонахождение	= Подразделение;
		
		Движение.Статус				= Перечисления.СтатусыКодовМаркировкиФакт.Распечатан;				
		
		Если фУпрощенныйРежим Тогда //упрощенный режим			
			Движение.Статус	= СтатусКМ_Факт;			
		КонецЕсли;		
	КонецЦикла;	
	
	//Если фАгрегироватьКоробки Тогда
		ЗаписатьСтатусКодов(ПолучитьУникальныеЗначенияКолонки("ШтрихкодКоробки"), Движения.СтатусыКМ_Факт, СтатусКМ_Факт);	
	//КонецЕсли;	
	
	Если фАгрегироватьБлочки Тогда
		ЗаписатьСтатусКодов(ПолучитьУникальныеЗначенияКолонки("ШтрихкодБлочка"), Движения.СтатусыКМ_Факт, СтатусКМ_Факт);
	КонецЕсли; 
	
	Если фАгрегироватьПалеты Тогда
		ЗаписатьСтатусКодов(ПолучитьУникальныеЗначенияКолонки("ШтрихкодПалеты"), Движения.СтатусыКМ_Факт, СтатусКМ_Факт);
	КонецЕсли;
	
КонецФункции //СформироватьДвижения(ЗаписыватьДвижения = Ложь) Экспорт

Функция ПолучитьТаблицуШК(ДокСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки			КАК ШтрихкодУпаковки,
	|	ШтрихкодУпаковки.ТипШК		КАК ТипШК,
	|	ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	ДатаБронированияКМ			КАК ДатаБронированияКМ
	|ИЗ
	|	" +  ДокСсылка.Метаданные().ПолноеИмя() + ".ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";                             
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуШК(ДокСсылка)

Функция ЗаполнитьПоРНК()
	Запрос = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	Документ.РасходнаяНакладная.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Номенклатура.СтатусКарточкиВЧЗ = ЗНАЧЕНИЕ(Перечисление.СтатусыКарточкиНоменклатурыВЧЗ.Опубликована)
	|	И ТребуетсяМаркировка
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура
	|";		
	
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);	
КонецФункции //ЗаполнитьПоРНК()

Функция ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "	
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	МАКСИМУМ(Ссылка)				КАК Единица,
	|	МАКСИМУМ(Коэффициент)			КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Единицы
	|ИЗ
	|	ВТ_КМ
	|ЛЕВОЕ СОЕДИНЕНИЕ	
	|	Справочник.Единицы КАК Единицы
	|ПО
	|	Единицы.Владелец = ВТ_КМ.ШтрихкодУпаковки.Владелец
	|	И Единицы.ОКЕИ = ВТ_КМ.ШтрихкодУпаковки.Владелец.БазоваяЕдиница	
	|	И НЕ Единицы.ПометкаУдаления
	|ГДЕ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец
	|;	
	|ВЫБРАТЬ
	|	ВТ_КМ.ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	МАКСИМУМ(ВТ_Единицы.Единица)		КАК Единица,
	|	МАКСИМУМ(ВТ_Единицы.Коэффициент)	КАК Коэффициент,
	|	СУММА(1) 							КАК Количество
	|ИЗ
	|	ВТ_КМ	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_Единицы
	|ПО
	|	ВТ_Единицы.Номенклатура = ШтрихкодУпаковки.Владелец
	|ГДЕ
	|	ШтрихкодУпаковки.Владелец <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодУпаковки.Владелец
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихкодУпаковки.Владелец.Наименование
	|";	
	
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок", ДокОбъект.ШтрихкодыУпаковок);
	
	ДокОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецФункции //ЗаполнитьТоварыПоКМ(ДокОбъект) Экспорт

Процедура ОбновитьСтатусыНанесения()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ * ПОМЕСТИТЬ ВТ_КМ ИЗ &ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|;
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки
	|ПОМЕСТИТЬ ВТ_НанесенныеКМ
	|ИЗ
	|	Документ.ЛистМаркировкиОстатков.ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка.ДокОснование = &ДокОснование
	|	И Ссылка.Завершен
	|	И Ссылка.Проведен
	|;
	|ВЫБРАТЬ
	|	ВТ_КМ.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ВТ_КМ.НомерСтроки
	|ИЗ
	|	ВТ_КМ
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТ_НанесенныеКМ
	|ПО
	|	ВТ_КМ.ШтрихкодУпаковки = ВТ_НанесенныеКМ.ШтрихкодУпаковки
	|ГДЕ
	|	НЕ ВТ_КМ.Нанесен
	|	И НЕ ВТ_НанесенныеКМ.ШтрихкодУпаковки ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ДокОснование",		Ссылка);
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок",	ШтрихкодыУпаковок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ШтрихкодыУпаковок[Выборка.НомерСтроки-1];
		Если СтрокаТЧ.ШтрихкодУпаковки = Выборка.ШтрихкодУпаковки Тогда
			СтрокаТЧ.Нанесен = Истина;					
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)	
	Если фУпрощенныйРежим Тогда
		мПроверяемыеРеквизиты = Новый Массив;
		Для Каждого Рекв Из ПроверяемыеРеквизиты Цикл
			Если Рекв <> "ШтрихкодыУпаковок.ЛистМаркировки" Тогда
				мПроверяемыеРеквизиты.Добавить(Рекв);							
			КонецЕсли;		
		КонецЦикла;		
		
		ПроверяемыеРеквизиты = мПроверяемыеРеквизиты;
	КонецЕсли; 
КонецПроцедуры

Процедура ОбновитьСоставКоробок()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ШтрихкодКоробки ИЗ (
	|	ВЫБРАТЬ ШтрихкодКоробки ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыКоробок ГДЕ Ссылка = &Ссылка
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ ШтрихкодБлочка ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок ГДЕ Ссылка = &Ссылка
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ ШтрихкодКоробки ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок ГДЕ Ссылка = &Ссылка
	|	ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ ШтрихкодПалеты ИЗ Документ.ЗаданиеНаМаркировку.ШтрихкодыУпаковок ГДЕ Ссылка = &Ссылка
	|) КАК Сводный
	|ГДЕ
	|	 ШтрихкодКоробки<>ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО 
	|	ШтрихкодКоробки.Наименование
	|";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ШтрихкодыКоробок.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры
